package jp.co.interprism.leaveapp.domain.休暇.種別;

import lombok.AllArgsConstructor;
import lombok.Getter;

@AllArgsConstructor
public enum 休暇種別 {
    有給休暇_全休(new 休暇種別名("有給休暇【全休】")),
    有給休暇_半休_午前(new 休暇種別名("有給休暇【半休・午前】")),
    有給休暇_半休_午後(new 休暇種別名("有給休暇【半休・午後】")),
    有給休暇_1h(new 休暇種別名("有給休暇【1h】")),
    有給休暇_2h(new 休暇種別名("有給休暇【2h】")),
    有給休暇_3h(new 休暇種別名("有給休暇【3h】")),
    欠勤(new 休暇種別名("欠勤")),
    遅刻(new 休暇種別名("遅刻")),
    早退(new 休暇種別名("早退")),
    代休_無給(new 休暇種別名("代休（無給）")),
    業務都合休暇(new 休暇種別名("業務都合休暇")),
    夏季休暇(new 休暇種別名("夏季休暇")),
    産前産後休暇(new 休暇種別名("産前産後休暇")),
    慶事休暇_本人(new 休暇種別名("慶事休暇【本人】")),
    慶事休暇_子女(new 休暇種別名("慶事休暇【子女】")),
    弔事休暇_2親等以内(new 休暇種別名("弔事休暇【2親等以内】")),
    弔事休暇_4親等以内(new 休暇種別名("弔事休暇【4親等以内】")),
    看護休暇(new 休暇種別名("看護休暇"));

    @Getter
    private final 休暇種別名 _休暇種別;
}
